[
  {
    "date": "2019-07-02",
    "editionNumber": 8,
    "doorsOpenTime": "",
    "talksStartTime": "",
    "teasers": []
  },
  {
    "date": "2019-05-28",
    "editionNumber": 7,
    "doorsOpenTime": "6:00pm",
    "talksStartTime": "6:30pm",
    "colloqLink": "https://colloq.io/events/a11y-meetup-berlin/2019/berlin/2",
    "meetupLink": "https://www.meetup.com/A11y-Meetup-Berlin/events/259443382/",
    "teasers": [
      {
        "headline": "Accessibility driven design",
        "subline": "Kama Jania, User Experience Designer at Polidea",
        "text": "You probably know that research with users is the key to success. But how to start it if you have a zero budget and only a vague idea for your product, which is about helping to reduce everyday obstacles for disabled people? For most products there are accessibility standards or guidelines available, which are the basic guide to ensure that your product is designed in a way accessible to everyone. However, standards and guidelines are not everything. What you need to do is to understand the everyday problems and challenges for disabled people as well as accessibility issues - how do people with disabilities interact with digital products, how do they use them and what are their needs?",
        "link": "https://twitter.com/kamajania",
        "slides": "https://docs.google.com/presentation/d/1TZHay8vZ2IHSx4ayh7ef45WGw7oJ7vgfkGw18mjkKB4/",
        "audio": "https://soundcloud.com/a11y-meetup-berlin/accessibility-driven-design"
      },
      {
        "headline": "Directive (EU) 2016/2102 and its adoption into Berlin Law (BIKTG Bln, 2019)",
        "subline": "Wiebke Müller and Cornelia Stolt, Department for Information- and Communication Technology Strategy at Berlin Senate Administration for Interior and Sports",
        "text": "Wiebke and Cornelia will summarize the EU directive on digital accessibility in the public sector and its adoption into Berlin law. Furthermore, they will explain how the city is implementing this law on an administrative level.",
        "link": "https://www.berlin.de/sen/inneres/moderne-verwaltung/digitale-barrierefreiheit/kompetenzstelle/",
        "slides": "https://docs.google.com/presentation/d/1GJPTkK2tUQ8wl5ZSvxCqGW8hPTmiDl_7IehMgwBiuOQ/edit?usp=sharing",
        "audio": "https://soundcloud.com/a11y-meetup-berlin/eu-directive-20162102"
      }
    ]
  },
  {
    "date": "2019-03-04",
    "editionNumber": 6,
    "doorsOpenTime": "7:15pm",
    "talksStartTime": "7:45pm",
    "colloqLink": "https://colloq.io/events/a11y-meetup-berlin/2019/berlin/1",
    "meetupLink": "https://www.meetup.com/A11y-Meetup-Berlin/events/258865968/",
    "teasers": [
      {
        "headline": "No more excuses: getting to the first 30%",
        "subline": "Tim von Oldenburg, Senior UX Engineer at ResearchGate",
        "text": "Only 30% of accessibility issues on a website can be caught by automated testing, according to the GDS accessibility team. But those 30% are a great baseline to operate from, and we should strive to make it as easy as possible for everyone to get there. In this talk, Tim will tell the story of how they’re trying to get to the first 30% at ResearchGate: how they approached those issues, the obstacles they’re facing, and what new exciting possibilities await them in the future.",
        "link": "https://twitter.com/sweeneytimm",
        "slides": "https://speakerdeck.com/tvooo/no-more-excuses-getting-the-first-30-percent-of-accessibility-issues",
        "video": "https://www.youtube.com/watch?v=z5xH8i-nkXs"
      },
      {
        "headline": "Accessible PDF",
        "subline": "Klaas Posselt, Freelance consultant / Print- and media technology",
        "text": "Navigating through unstructured documents is a really problematic process especially for people with visual impairments. In his talk Klaas will share with us the basic knowledge about accessible PDF files and they ways to create them.",
        "link": "https://twitter.com/einmanncombo",
        "slides": "https://www.dropbox.com/s/wq7n05by577lx86/slides_a11y-Berlin_20190304.pdf?dl=0",
        "video": "https://www.youtube.com/watch?v=UugXCKOlf_A"
      }
    ]
  },
  {
    "date": "2018-12-11",
    "editionNumber": 5,
    "doorsOpenTime": "7:00pm",
    "talksStartTime": "7:30pm",
    "colloqLink": "https://colloq.io/events/a11y-meetup-berlin/2018/berlin/5",
    "meetupLink": "https://www.meetup.com/A11y-Meetup-Berlin/events/255450708/",
    "teasers": [
      {
        "headline": "WCAG 2.1 : quick overview and slow digestion",
        "subline": "Aurélien Levy, Accessibility expert and CEO of Temesis",
        "text": "During this talk, Aurélien will quickly present the new success criteria of WCAG 2.1 avoiding jargon terminology. Using concrete examples he will tell us what it changes in term of design or development. On the menu, mobile, low vision, voice recognition and cognitive disability contexts.",
        "link": "https://twitter.com/sweeneytimm",
        "video": "https://www.youtube.com/watch?v=eVG6lWM7RQ8"
      }
    ]
  },
  {
    "date": "2018-09-01",
    "editionNumber": 4,
    "doorsOpenTime": "7:00pm",
    "talksStartTime": "7:30pm",
    "colloqLink": "https://colloq.io/events/a11y-meetup-berlin/2018/berlin/4",
    "meetupLink": "https://www.meetup.com/A11y-Meetup-Berlin/events/251177628/",
    "teasers": [
      {
        "headline": "Beyond translations — technical, logistical and cultural constraints of an international online shop",
        "subline": "Matthias Kentzia, Product Manager at Project A",
        "text": "Going international can reap huge financial benefits for a company. But internationalising your product is not as simple as just translating a couple of texts. In order to make it accessible, you need to localise the entire experience. In this talk, we’ll be looking at a case-study to explore some of the less obvious requirements of an internationalisation project.",
        "link": "http://mattkentzia.com/",
        "slides": "https://drive.google.com/file/d/1I1nhj7OfWdt6dIOf8r9iaL2JPxsLKeFB/view",
        "video": "https://www.youtube.com/watch?v=CR9n8SJt8RA"
      }
    ]
  },
  {
    "date": "2018-05-17",
    "editionNumber": 3,
    "doorsOpenTime": "7:00pm",
    "talksStartTime": "7:30pm",
    "colloqLink": "https://colloq.io/events/a11y-meetup-berlin/2018/berlin/3",
    "meetupLink": "https://www.meetup.com/A11y-Meetup-Berlin/events/248802820/",
    "teasers": [
      {
        "headline": "Da Vinci KeyCode — Keyboard navigation in the age of the touch screens",
        "subline": "Develoger, Frontend Developer at Smava",
        "text": "Mass consumption of the Internet started with a click. At least that is true for the lucky majority of the population who either have no issues with their eye sight or just don't like to use the keyboard. Remaining people depend, or are just in love with pressing keys. This talk is not about their struggle, it's about how-to implement the inclusion on the tech level.",
        "link": "https://develoger.com/",
        "video": "https://www.youtube.com/watch?v=afiJnirfFOc"
      },
      {
        "headline": "Accessibility — Designing for the real world",
        "subline": "Hugo Giraudel, Frontend developer, Accessibility advocate, Author, Speaker",
        "text": "We all know that accessibility should be baked in all our projects. But what is it even? This topic is so wide that it is sometimes hard to grasp. We’ll take the amazing opportunity to meet on the Global Accessibility Awareness Day to discuss how accessibility blends into inclusive design, and what it means to design for all people.",
        "link": "https://hugogiraudel.com/",
        "video": "https://www.youtube.com/watch?v=ZUXxxYHYPcs"
      },
      {
        "headline": "Testing Accessibility with a Screen Reader",
        "subline": "Sergei Kriger, Frontend developer at SinnerSchrader",
        "text": "Screen reader is the most popular tool used by people with visual impairments to browse the web. As a rule screen readers have a quite high learning curve due to their complexity and different (non-visual) approach of getting information. In this presentation you will figure out best practices of navigating web pages with a screen reader, learn how to use those practices for accessibility testing on both Mac OS and Windows and understand how to avoid the most common pitfalls when getting started using a screen reader.",
        "link": "http://sergeikriger.com/",
        "video": "https://www.youtube.com/watch?v=RhzmOSgrfP8"
      }
    ]
  },
  {
    "date": "2018-03-20",
    "editionNumber": 2,
    "doorsOpenTime": "7:00pm",
    "talksStartTime": "7:30pm",
    "colloqLink": "https://colloq.io/events/a11y-meetup-berlin/2018/berlin/2",
    "meetupLink": "https://www.meetup.com/A11y-Meetup-Berlin/events/246827760/",
    "teasers": [
      {
        "headline": "Web Accessibility Principles and how we break them",
        "subline": "Lucas da Silva, Frontend Developer at HelloFresh",
        "text": "Lucas will go through the four principles of Web Accessibility, show how we may break them, and instigate key questions we can ask ourselves in order to build inclusive products.",
        "link": "https://lcs.sh/",
        "slides": "https://docs.google.com/presentation/d/1h36YipgkSGxNsXC63PP4qFQGwqB9I4tt_a5cjvVSfWk/edit#slide=id.g3501b48938_0_3",
        "video": "https://www.youtube.com/watch?v=tsVLv5cyr0k"
      },
      {
        "headline": "Better development strategy for web accessibility – an overview of the available tools",
        "subline": "Radimir Bitsov, Frontend Engineer / Perforamance and Accessibility Consultant",
        "text": "With an increasing awareness of the accessibility and inclusivity importance comes the responsibility of defining a better design and development strategy for creating accessible websites and apps. Fortunately, there are tools that can help us improve the quality of our projects in terms of web accessibility. In this talk, Radimir will present in details some of the available options and their use cases.",
        "link": "https://www.radibit.com/",
        "slides": "https://speakerdeck.com/radibit/better-development-strategy-for-web-a11y-an-overview-of-the-available-tools",
        "video": "https://www.youtube.com/watch?v=bUswZRp47rY"
      }
    ]
  },
  {
    "date": "2018-01-16",
    "editionNumber": 1,
    "doorsOpenTime": "7:00pm",
    "talksStartTime": "7:30pm",
    "colloqLink": "https://colloq.io/events/a11y-meetup-berlin/2018/berlin/1",
    "meetupLink": "https://www.meetup.com/A11y-Meetup-Berlin/events/245047218/",
    "teasers": [
      {
        "headline": "Wheelmap.org – Mapping the accessibility of places with the help of people and technology",
        "subline": "Svenja Heinecke & Sebastian Felix Zappe",
        "text": "Since Wheelmap was launched in 2010, a mapping crowd consisting of thousands of people from all over the world has contributed more than 830,000 ratings on the wheelchair accessibility of public places. Facing the demands of keeping a simple UX design, sorting a jungle of data licenses and data sources and eyeing the ultimate goal of “disability mainstreaming”, the Wheelmap team has started the project “Accessibility Cloud”. With this new infrastructure, we are exploring new solutions for creating a bigger impact for accessibility mapping outcomes. Svenja and Sebastian will give you an insight into the status quo and the latest community and IT developments.",
        "link": "http://wheelmap.org",
        "video": "https://www.youtube.com/watch?v=Youiw3lkAgU"
      },
      {
        "headline": "Decrease your conversion - common ways to lock people out",
        "subline": "Stefan Judis",
        "text": "Building products for the web means building products for everybody. We spend hours and hours on optimising user flows, tweaking designs and A/B testing the heck out of everything. The problem is that we as developers, product owners and designers often think about the targeted customer under optimal conditions and ignore minorities. In this talk, Stefan will take a look at common problems of the web today and demonstrate how we can make it a more welcoming place.",
        "link": "https://www.stefanjudis.com/",
        "slides": "https://speakerdeck.com/stefanjudis/decrease-your-conversion-common-ways-to-lock-people-out",
        "video": "https://www.youtube.com/watch?v=3OuiQ-eUyd8"
      }
    ]
  }
]
