[
  {
    "date": "2021-01-20",
    "editionNumber": 13,
    "doorsOpenTime": "6:30pm",
    "talksStartTime": "7:00pm",
    "meetupLink": "https://www.meetup.com/A11y-Meetup-Berlin/events/275173450/",
    "teasers": [
      {
        "headline": "Designing for the extremes - design thinking and turning everyone into an a11y persona",
        "subline": "Beatriz Gonzalez Mellidez (Principal Product Designer, SinnerSchrader)",
        "text": "When we design for average users, we are missing the sweet spot that leads to innovation and disruption. Many customers don't want to hear the word accessibility but get excited about design thinking. We can use design thinking techniques to get our stakeholders excited about accessibility and inclusive design even if they would have never been interested in buying it otherwise.",
        "link": "http://twitter.com/b_atish",
        "video": "https://www.youtube.com/watch?v=ZGu-vUzf3iE",
        "slides": "https://speakerdeck.com/b_atish/designing-for-the-extremes-design-thinking-and-turning-everyone-into-an-a11y-persona"
      },
      {
        "headline": "Retrofitting for an accessible color palette: beyond the 'nice-to-have' improvement",
        "subline": "Marion Couesnon (Interaction Designer)",
        "text": "Retrofitting doesn’t have a good reputation. Yet many products and websites published without accessibility in mind need to retrofit to be more accessible. In this talk, I would share my experience of retrofitting for an accessible palette. Beyond reaching compliance, I try to incorporate accessibility regulations as a core element of the designs so that they can no longer be ignored.",
        "link": "https://twitter.com/marioncouesnon",
        "video": "https://www.youtube.com/watch?v=9VBF6chLiKA",
        "slides": "https://drive.google.com/file/d/1Hm_-8CWaQedTa7kykdY-79X-TtihwqjW/view"
      }
    ]
  },
  {
    "date": "2020-06-09",
    "editionNumber": 12,
    "doorsOpenTime": "6:30pm",
    "talksStartTime": "7:00pm",
    "meetupLink": "https://www.meetup.com/A11y-Meetup-Berlin/events/270405303/",
    "teasers": [
      {
        "headline": "Living With Asperger's",
        "subline": "Dr. Ian McDonald (CTO in residence, Microsoft for Startups)",
        "text": "Dr Ian McDonald has been a visionary technology leader for over 20 years and is currently CTO in residence at Microsoft for Startups covering Western Europe. He’s previously lead teams at a range of corporates and startups & built global scale systems. Ian is resident in the London office assisting startups in the ScaleUp late stage accelerator, alongside leading the AI Factory team in France. He also works across the startup ecosystem to help people unleash their dreams using the power of Microsoft technology. In particular Ian is passionate about assisting under-represented people. Ian will talk about his diagnosis, his background, & how having Asperger's affects his life.",
        "link": "https://twitter.com/imcdnzl",
        "video": "https://www.youtube.com/watch?v=PHa8HKtH1do"
      },
      {
        "headline": "Neurodiversity In Tech",
        "subline": "Wesley Faulkner, Virginie Caplet, Franziska Hauck",
        "text": "Wesley Faulkner is a first-generation American. He is a founding member of the government transparency group Open Austin & ran for Austin City Council in 2016. His professional experience also includes work as a social media & community manager for the software company Atlassian, & various roles for the computer processor company AMD, Dell, and IBM. Wesley Faulkner serves as a board member for South by Southwest Interactive (SXSWi) & works as a Technical Community Manager for MongoDB. Virginie Caplet is a senior product designer passionate about user research & agile practices. After more than 15 years in the digital industry, she decided her mission would be to help organizations, teams, & individuals to get rid of legacy systems, legacy practices, & legacy mindsets. Along the way, she discovered how to take advantage of being neurodiverse by using the uncommon perspectives & connections it creates to better spread knowledge about creativity, design leadership, & passion for the craft.",
        "link": "https://www.youtube.com/watch?v=iNN-czpOx9w",
        "video": "https://www.youtube.com/watch?v=iNN-czpOx9w"
      }
    ]
  },
  {
    "date": "2020-05-12",
    "editionNumber": 11,
    "doorsOpenTime": "6:30pm",
    "talksStartTime": "7:00pm",
    "meetupLink": "https://www.meetup.com/A11y-Meetup-Berlin/events/269177611/",
    "teasers": [
      {
        "headline": "Accessibility in video games",
        "subline": "Taner Aydin (Web dev and accessibility consultant)",
        "text": "When I've started in accessibility I learned a lot about real life a11y, regulations, mandatory a11y for public sector websites and apps and hopefully soon mandatory accessibility for the private sector as well. These are all the minimum requirements for accessibility. But I wanted to see what we can already do for a11y on the other end of the spectrum with private entertainment products. This to me opened the door to the huge new accessibility world inside video games. In my talk I want to give a broad overview of what a11y for gamers means, what common missteps there are, and show techniques to improve a11y in video games.",
        "link": "https://taner-aydin.dev",
        "slides": "https://drive.google.com/file/d/1IaY0-tA_hk0Kxr8v8hhgDX2fA5upPdQP/view"
      },
      {
        "headline": "Building WEB APP for everyone - a11y with React",
        "subline": "Manjula Dube (Web Engineer, N26)",
        "text": "With the growing community and great tutorials, it's fairly easy nowadays to start building web applications with React. However, the vital aspect of accessibility is often missing which leads to web applications creating exclusions. Nothing in React prevents us from building accessible web experiences, but we need to learn to harness its power in the right way while dealing with some unique challenges caused by creating web pages with JavaScript. This talk will focus on how to solve these issues in the context of React. It'll also emphasise why it is important to build accessible web apps. In the end I will also share some cool things that chrome dev tools provides you in order to make your web app more accessible.",
        "link": "https://twitter.com/manjula_dube",
        "slides": "https://a11y-with-manjula.netlify.app"
      }
    ]
  },
  {
    "date": "2020-03-17",
    "editionNumber": 10,
    "doorsOpenTime": "6:30pm",
    "talksStartTime": "7:00pm",
    "colloqLink": "https://colloq.io/events/a11y-meetup-berlin/2020/berlin/1",
    "meetupLink": "https://www.meetup.com/A11y-Meetup-Berlin/events/268636426/",
    "teasers": [
      {
        "headline": "Build Web with empathy",
        "subline": "Manjula Dube (Web Engineer, N26)",
        "text": "Building web applications has been fairly easy now, However, an often-missing ingredient in many web applications is a focus on accessibility best practices — especially when component libraries are part of their application. Nothing in frameworks prevents us from building accessible web apps, but we need to learn to harness its power in the right way while dealing with some unique challenges caused by creating web pages with JavaScript. This talk will focus on these issues and how to solve them in the real world, while also adding some a11y power to your development process. This talk will also focus on why it is important to build accessible web apps.",
        "link": "https://twitter.com/manjula_dube"
      },
      {
        "headline": "The Power of the Individual and Individual Acts",
        "subline": "Beatriz Crespo (UX Lead, Caspar Health)",
        "text": "Daily decisions taken in design or government offices are leaving part of the population aside (e.g. making it impossible for many people to use online services that are by now mandatory). In this talk, we will reflect on the power of the individual, regardless of the role they may have in their company or society, to act and how seemingly small or unimportant decisions can in fact contribute to greater transformative change.",
        "link": "https://www.linkedin.com/in/beatritze/"
      }
    ]
  },
  {
    "date": "2019-10-28",
    "editionNumber": 9,
    "doorsOpenTime": "6:30pm",
    "talksStartTime": "7:00pm",
    "colloqLink": "https://colloq.io/events/a11y-meetup-berlin/2019/virtual/2",
    "meetupLink": "https://www.meetup.com/A11y-Meetup-Berlin/events/265683907/",
    "teasers": [
      {
        "headline": "How to build empathy for strangers with special needs",
        "subline": "Kai Katonina, UX designer at DKB",
        "text": "If you don't have disabled people around, it might be hard to see people behind the formal requirements of WCAG. Of course the best strategy is to meet them personally, but it's not always easy. I want to share how I grew from an ignorant person to a strong advocate for accessibility and inclusivity just by lying on a couch and watching Youtube. I will talk about why it's important to build this kind of empathy and share videos that changed me.",
        "link": "https://www.linkedin.com/in/katonina/",
        "slides": "https://docs.google.com/presentation/d/1Qgx1TeeRtzuKgPUAf1n0Af89HmUyCc7ieCOgmQ7fdi4"
      },
      {
        "headline": "Accessibility, Inputs & Vue",
        "subline": "Oscar Braunert (Web developer,  Kitchen Stories)",
        "text": "At the end of February, WebAIM published The WebAIM Million, an accessibility analysis of the homepages of the one million most visited websites. The findings are depressing. The average site contained about 60 errors. Things went even more downhill when putting JS frameworks in the equation. As a reaction to those findings, this talk tries to shed light on some accessibility best practices regarding accessible inputs, as well as do soul-searching why we, as developers, have failed so badly.",
        "link": "https://twitter.com/_ovlb",
        "slides": "https://talks.ovl.design/OY4mvA"
      }
    ]
  },
  {
    "date": "2019-07-02",
    "editionNumber": 8,
    "doorsOpenTime": "6:30pm",
    "talksStartTime": "7:00pm",
    "colloqLink": "https://colloq.io/events/a11y-meetup-berlin/2019/berlin/3",
    "meetupLink": "https://www.meetup.com/A11y-Meetup-Berlin/events/261798213/",
    "teasers": [
      {
        "headline": "A11y checklist for everyone",
        "subline": "Priyanka Naik, Front-end developer and accessibility in-charge at diesdas.digital",
        "text": "I believe A11y is a team effort and everyone has a role to play in the project. So, I have checklist for specific roles like for project manager, UI/UX designer, and developer. The Idea is to present the checklist with the Right tools which can help them testing. Hence talk will be helpful for everyone, one who has zero knowledge, can learn checklist and tools laters he/she will be able to make an accessible website.",
        "link": "https://twitter.com/priyankanaik625",
        "slides": "https://speakerdeck.com/priyankanaik625/accessibility-checklist-for-everyone",
        "video": "https://www.youtube.com/watch?v=lxzZsRjcrdM&t=3s"
      },
      {
        "headline": "Lower literacy: it’s not the user, it’s the product!",
        "subline": "Damien Senger, Design systems & Accessibility lead at Castor EDC",
        "text": "Reading is not an easy thing. It is complicated for people with reading or cognitive impairments but also for everybody depending of the context. Luckily for all our users, there is a lot of small improvements and tips every designer, content-writer and developer can do in a project to improve the life all of our users.",
        "link": "https://twitter.com/iamhiwelo",
        "slides": "https://noti.st/hiwelo/gRno0o/lower-literacy-its-not-the-user-its-the-product",
        "video": "https://www.youtube.com/watch?v=1k76wSc8h1U"
      },
      {
        "headline": "An intro to accessible web-apps",
        "subline": "Marcus Herrmann, Freelance web developer, consultant for web accessibility",
        "text": "A brief introduction to accessible web apps, what new challenges they bring for users of assistive technologies - and how both JavaScript framework creators and accessibility folks could help ensure that developers can truly develop 'web-apps for everyone'.",
        "link": "https://twitter.com/_marcusherrmann",
        "slides": "https://noti.st/marcus/1gMwdH/an-intro-to-accessible-web-apps",
        "video": "https://www.youtube.com/watch?v=-TNrTZd3nmk"
      }
    ]
  },
  {
    "date": "2019-05-28",
    "editionNumber": 7,
    "doorsOpenTime": "6:00pm",
    "talksStartTime": "6:30pm",
    "colloqLink": "https://colloq.io/events/a11y-meetup-berlin/2019/berlin/2",
    "meetupLink": "https://www.meetup.com/A11y-Meetup-Berlin/events/259443382/",
    "teasers": [
      {
        "headline": "Accessibility driven design",
        "subline": "Kama Jania, User Experience Designer at Polidea",
        "text": "You probably know that research with users is the key to success. But how to start it if you have a zero budget and only a vague idea for your product, which is about helping to reduce everyday obstacles for disabled people? For most products there are accessibility standards or guidelines available, which are the basic guide to ensure that your product is designed in a way accessible to everyone. However, standards and guidelines are not everything. What you need to do is to understand the everyday problems and challenges for disabled people as well as accessibility issues - how do people with disabilities interact with digital products, how do they use them and what are their needs?",
        "link": "https://twitter.com/kamajania",
        "slides": "https://speakerdeck.com/a11yberlin/accessibility-driven-design",
        "audio": "https://soundcloud.com/a11y-berlin/accessibility-driven-design"
      },
      {
        "headline": "Directive (EU) 2016/2102 and its adoption into Berlin Law (BIKTG Bln, 2019)",
        "subline": "Wiebke Müller and Cornelia Stolt, Department for Information- and Communication Technology Strategy at Berlin Senate Administration for Interior and Sports",
        "text": "Wiebke and Cornelia will summarize the EU directive on digital accessibility in the public sector and its adoption into Berlin law. Furthermore, they will explain how the city is implementing this law on an administrative level.",
        "link": "https://www.berlin.de/sen/inneres/moderne-verwaltung/digitale-barrierefreiheit/kompetenzstelle/",
        "slides": "https://speakerdeck.com/a11yberlin/2102-and-its-adoption-into-berlin-law-biktg-bln-2019",
        "audio": "https://soundcloud.com/a11y-berlin/eu-directive-20162102"
      }
    ]
  },
  {
    "date": "2019-03-04",
    "editionNumber": 6,
    "doorsOpenTime": "7:15pm",
    "talksStartTime": "7:45pm",
    "colloqLink": "https://colloq.io/events/a11y-meetup-berlin/2019/berlin/1",
    "meetupLink": "https://www.meetup.com/A11y-Meetup-Berlin/events/258865968/",
    "teasers": [
      {
        "headline": "No more excuses: getting to the first 30%",
        "subline": "Tim von Oldenburg, Senior UX Engineer at ResearchGate",
        "text": "Only 30% of accessibility issues on a website can be caught by automated testing, according to the GDS accessibility team. But those 30% are a great baseline to operate from, and we should strive to make it as easy as possible for everyone to get there. In this talk, Tim will tell the story of how they’re trying to get to the first 30% at ResearchGate: how they approached those issues, the obstacles they’re facing, and what new exciting possibilities await them in the future.",
        "link": "https://twitter.com/sweeneytimm",
        "slides": "https://speakerdeck.com/tvooo/no-more-excuses-getting-the-first-30-percent-of-accessibility-issues",
        "video": "https://www.youtube.com/watch?v=z5xH8i-nkXs"
      },
      {
        "headline": "Accessible PDF",
        "subline": "Klaas Posselt, Freelance consultant / Print- and media technology",
        "text": "Navigating through unstructured documents is a really problematic process especially for people with visual impairments. In his talk Klaas will share with us the basic knowledge about accessible PDF files and they ways to create them.",
        "link": "https://twitter.com/einmanncombo",
        "slides": "https://www.dropbox.com/s/wq7n05by577lx86/slides_a11y-Berlin_20190304.pdf?dl=0",
        "video": "https://www.youtube.com/watch?v=UugXCKOlf_A"
      }
    ]
  },
  {
    "date": "2018-12-11",
    "editionNumber": 5,
    "doorsOpenTime": "7:00pm",
    "talksStartTime": "7:30pm",
    "colloqLink": "https://colloq.io/events/a11y-meetup-berlin/2018/berlin/5",
    "meetupLink": "https://www.meetup.com/A11y-Meetup-Berlin/events/255450708/",
    "teasers": [
      {
        "headline": "WCAG 2.1 : quick overview and slow digestion",
        "subline": "Aurélien Levy, Accessibility expert and CEO of Temesis",
        "text": "During this talk, Aurélien will quickly present the new success criteria of WCAG 2.1 avoiding jargon terminology. Using concrete examples he will tell us what it changes in term of design or development. On the menu, mobile, low vision, voice recognition and cognitive disability contexts.",
        "link": "https://twitter.com/sweeneytimm",
        "video": "https://www.youtube.com/watch?v=eVG6lWM7RQ8"
      }
    ]
  },
  {
    "date": "2018-09-01",
    "editionNumber": 4,
    "doorsOpenTime": "7:00pm",
    "talksStartTime": "7:30pm",
    "colloqLink": "https://colloq.io/events/a11y-meetup-berlin/2018/berlin/4",
    "meetupLink": "https://www.meetup.com/A11y-Meetup-Berlin/events/251177628/",
    "teasers": [
      {
        "headline": "Beyond translations — technical, logistical and cultural constraints of an international online shop",
        "subline": "Matthias Kentzia, Product Manager at Project A",
        "text": "Going international can reap huge financial benefits for a company. But internationalising your product is not as simple as just translating a couple of texts. In order to make it accessible, you need to localise the entire experience. In this talk, we’ll be looking at a case-study to explore some of the less obvious requirements of an internationalisation project.",
        "link": "http://mattkentzia.com/",
        "slides": "https://drive.google.com/file/d/1I1nhj7OfWdt6dIOf8r9iaL2JPxsLKeFB/view",
        "video": "https://www.youtube.com/watch?v=CR9n8SJt8RA"
      }
    ]
  },
  {
    "date": "2018-05-17",
    "editionNumber": 3,
    "doorsOpenTime": "7:00pm",
    "talksStartTime": "7:30pm",
    "colloqLink": "https://colloq.io/events/a11y-meetup-berlin/2018/berlin/3",
    "meetupLink": "https://www.meetup.com/A11y-Meetup-Berlin/events/248802820/",
    "teasers": [
      {
        "headline": "Da Vinci KeyCode — Keyboard navigation in the age of the touch screens",
        "subline": "Develoger, Frontend Developer at Smava",
        "text": "Mass consumption of the Internet started with a click. At least that is true for the lucky majority of the population who either have no issues with their eye sight or just don't like to use the keyboard. Remaining people depend, or are just in love with pressing keys. This talk is not about their struggle, it's about how-to implement the inclusion on the tech level.",
        "link": "https://develoger.com/",
        "video": "https://www.youtube.com/watch?v=afiJnirfFOc"
      },
      {
        "headline": "Accessibility — Designing for the real world",
        "subline": "Kitty Giraudel, Frontend developer, Accessibility advocate, Author, Speaker",
        "text": "We all know that accessibility should be baked in all our projects. But what is it even? This topic is so wide that it is sometimes hard to grasp. We’ll take the amazing opportunity to meet on the Global Accessibility Awareness Day to discuss how accessibility blends into inclusive design, and what it means to design for all people.",
        "link": "https://kittygiraudel.com/",
        "video": "https://www.youtube.com/watch?v=ZUXxxYHYPcs"
      },
      {
        "headline": "Testing Accessibility with a Screen Reader",
        "subline": "Sergei Kriger, Frontend developer at SinnerSchrader",
        "text": "Screen reader is the most popular tool used by people with visual impairments to browse the web. As a rule screen readers have a quite high learning curve due to their complexity and different (non-visual) approach of getting information. In this presentation you will figure out best practices of navigating web pages with a screen reader, learn how to use those practices for accessibility testing on both Mac OS and Windows and understand how to avoid the most common pitfalls when getting started using a screen reader.",
        "link": "http://sergeikriger.com/",
        "video": "https://www.youtube.com/watch?v=RhzmOSgrfP8"
      }
    ]
  },
  {
    "date": "2018-03-20",
    "editionNumber": 2,
    "doorsOpenTime": "7:00pm",
    "talksStartTime": "7:30pm",
    "colloqLink": "https://colloq.io/events/a11y-meetup-berlin/2018/berlin/2",
    "meetupLink": "https://www.meetup.com/A11y-Meetup-Berlin/events/246827760/",
    "teasers": [
      {
        "headline": "Web Accessibility Principles and how we break them",
        "subline": "Lucas da Silva, Frontend Developer at HelloFresh",
        "text": "Lucas will go through the four principles of Web Accessibility, show how we may break them, and instigate key questions we can ask ourselves in order to build inclusive products.",
        "link": "https://lcs.sh/",
        "slides": "https://docs.google.com/presentation/d/1h36YipgkSGxNsXC63PP4qFQGwqB9I4tt_a5cjvVSfWk/edit#slide=id.g3501b48938_0_3",
        "video": "https://www.youtube.com/watch?v=tsVLv5cyr0k"
      },
      {
        "headline": "Better development strategy for web accessibility – an overview of the available tools",
        "subline": "Radimir Bitsov, Frontend Engineer / Perforamance and Accessibility Consultant",
        "text": "With an increasing awareness of the accessibility and inclusivity importance comes the responsibility of defining a better design and development strategy for creating accessible websites and apps. Fortunately, there are tools that can help us improve the quality of our projects in terms of web accessibility. In this talk, Radimir will present in details some of the available options and their use cases.",
        "link": "https://www.radibit.com/",
        "slides": "https://speakerdeck.com/radibit/better-development-strategy-for-web-a11y-an-overview-of-the-available-tools",
        "video": "https://www.youtube.com/watch?v=bUswZRp47rY"
      }
    ]
  },
  {
    "date": "2018-01-16",
    "editionNumber": 1,
    "doorsOpenTime": "7:00pm",
    "talksStartTime": "7:30pm",
    "colloqLink": "https://colloq.io/events/a11y-meetup-berlin/2018/berlin/1",
    "meetupLink": "https://www.meetup.com/A11y-Meetup-Berlin/events/245047218/",
    "teasers": [
      {
        "headline": "Wheelmap.org – Mapping the accessibility of places with the help of people and technology",
        "subline": "Svenja Heinecke & Sebastian Felix Zappe",
        "text": "Since Wheelmap was launched in 2010, a mapping crowd consisting of thousands of people from all over the world has contributed more than 830,000 ratings on the wheelchair accessibility of public places. Facing the demands of keeping a simple UX design, sorting a jungle of data licenses and data sources and eyeing the ultimate goal of “disability mainstreaming”, the Wheelmap team has started the project “Accessibility Cloud”. With this new infrastructure, we are exploring new solutions for creating a bigger impact for accessibility mapping outcomes. Svenja and Sebastian will give you an insight into the status quo and the latest community and IT developments.",
        "link": "http://wheelmap.org",
        "video": "https://www.youtube.com/watch?v=Youiw3lkAgU"
      },
      {
        "headline": "Decrease your conversion - common ways to lock people out",
        "subline": "Stefan Judis",
        "text": "Building products for the web means building products for everybody. We spend hours and hours on optimising user flows, tweaking designs and A/B testing the heck out of everything. The problem is that we as developers, product owners and designers often think about the targeted customer under optimal conditions and ignore minorities. In this talk, Stefan will take a look at common problems of the web today and demonstrate how we can make it a more welcoming place.",
        "link": "https://www.stefanjudis.com/",
        "slides": "https://speakerdeck.com/stefanjudis/decrease-your-conversion-common-ways-to-lock-people-out",
        "video": "https://www.youtube.com/watch?v=3OuiQ-eUyd8"
      }
    ]
  }
]
